Autodesk.Revit.DB.DistanceMeasuredFrom
Indicates if the distance is measured from the top or bottom of the wall.
Since:
2012

Autodesk.Revit.DB.DistanceMeasuredFrom.Top
From top.

Autodesk.Revit.DB.DistanceMeasuredFrom.Base
From bottom.